import React from "react";
import Header from "../components/header";
import Footr from "../components/footer";
import Animator from "../components/animator";
import TopBtn from "../components/topBtn";


import imgPres from "../assets/1.png";
import imgNow from "../assets/info/ (1).jpg";

const Story = () => {
  return (
    <>
      <Header />

      <Animator>
        <TopBtn/>

        <div className="story">
          <h1>قصتنــا</h1>
          <p>
            في أعماق وادي حوف بحلوان، القاهرة، ترتقي "شركة نصر لصناعة السيارات"
            كواحدة من أبرز الشركات في قطاع الصناعات بمصر، حيث تروي قصةً ملهمة عن
            الإبداع والتطور في عالم صناعة السيارات. بدأت القصة في الستينيات عندما
            أسس الرئيس جمال عبد الناصر هذه الشركة كجزء من مشروع الحكومة المصرية
            الطموح "من الإبرة إلى الصاروخ". ومن هنا، بدأت نصر في تجميع سيارات فيات
            في مصانعها،
          </p>
          <iframe
            src="https://www.youtube.com/embed/5bczaZCYhJM"
            frameborder="0"
            allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
            allowfullscreen
          ></iframe>
          <p>
            وسرعان ما حظيت بثقة المصريين، فأصبحت سيارات نصر هي الخيار الأول
            والأكثر مبيعًا في السوق المصرية، بفضل جودتها وأدائها الممتاز الذي لا
            يقل عن مثيلاتها المصنعة في إيطاليا. واستمرت قصة النجاح، حيث بقيت نصر
            وفيا لتراثها وتعهداتها، فلم تتوقف عن تصنيع سيارات فيات التي انتهى
            إنتاجها في إيطاليا. بالتعاون مع شركة زستافا اليوغوسلافية، استطاعت نصر
            إنتاج سيارة 128 التي تعتبر إحدى أبرز الطرازات التي نجحت في السوق
            المصرية، رغم تحديات الزمن والتطورات التكنولوجية.
          </p>
          <img src={imgPres} width={"200px"} alt="الرئيس جمال عبد الناصر" />
          <p>
            ولكن لم تتوقف القصة هنا، بل استمرت نصر في التطور والتجديد، حيث أطلقت
            سيارة نصر شاهين، وهي موديل معدل مستوحى من سيارة فيات 131 التركية،
            وأيضًا سيارة فلوريدا بالتعاون مع يوجو، مما يبرز التزامها بالتطوير
            المستمر وتقديم المنتجات المبتكرة. وهكذا، تبقى شركة نصر لصناعة السيارات
            شاهدة على تاريخ الصناعة المصرية، حيث ترسخ قصتها النجاح والتطور المستمر
            في عالم صناعة السيارات. في بداية الأمر، كانت "شركة النصر لصناعة
            السيارات" قصة نجاح مصرية مشرقة، ولكن مع مرور الزمن تحوَّلت هذه القصة
            إلى درس مؤلم في تحديات الصناعة والاقتصاد. كانت الشركة، التي أُنشِئَت
            بقرار رئيس جمهورية مصر العربية جمال عبد الناصر في عام 1960، جزءًا من
            رؤية الحكومة المصرية الطموحة المعروفة باسم "من الإبرة إلى الصاروخ".
            هدفت الشركة إلى تصنيع السيارات الكهربائية المصرية، حيث بدأت بتجميع
            السيارات في المرحلة الأولى لتنتقل بعدها إلى التصنيع الكامل في المرحلة
            اللاحقة. وضعت الشركة مقرها الرئيسي ومصنعها في منطقة وادي حوف بحلوان
            جنوب القاهرة، وبدأت بإنتاج عدة طرازات من السيارات والشاحنات، ولفترة من
            الزمن كانت تُعَدُّ رمزًا للتقدم الصناعي في مصر. ومع انقضاء الزمن ودخول
            السبعينيات والثمانينيات، بدأت تظهر علامات الضعف في أداء الشركة، حيث
            تعرضت لتحديات متزايدة من جراء التطورات الاقتصادية والتكنولوجية
            العالمية. وفي بداية التسعينيات، تدهورت الأوضاع بشكل كبير، مما أدى إلى
            إصدار قرار بتصفيتها في نوفمبر 2009. ومع ذلك، لم تنته القصة هنا،
          </p>
          <img src={imgNow} width={"100px"} alt="الرئيس جمال عبد الناصر" />
          <p>
            فقد شهدت "شركة النصر لصناعة السيارات" عودة مفاجئة ومثيرة للإعجاب في
            مارس 2013، عندما تمت إعادة فتحها وإعادة تشغيلها.
          </p>
        </div>
      </Animator>

      <Footr/>
    </>
  );
};

export default Story;
